Процедура ОбработкаПроведения(Отказ, Режим)                                                                                                                       
                                                                                                                                                                         
        // Включаем запись движений по регистру ОстаткиТоваров                                                                                                           
        Движения.ОстаткиТоваров.Записывать = Истина;                                                                                                                     
                                                                                                                                                                         
        // Обходим строки табличной части документа                                                                                                                      
        Для Каждого ТекСтрокаТовары Из Товары Цикл                                                                                                                       
                                                                                                                                                                             
            // Оприходовать на склад можно только товары (не услуги тарифов!)                                                                                                
            Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда                                                                    
                                                                                                                                                                                 
                Движение = Движения.ОстаткиТоваров.ДобавитьПриход();                                                                                                             
                Движение.Период       = Дата;                                                                                                                                    
                Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;                                                                                                            
                Движение.Склад        = Склад;                                                                                                                                   
                Движение.Количество   = ТекСтрокаТовары.Количество;                                                                                                              
                                                                                                                                                                                 
            КонецЕсли;                                                                                                                                                       
                                                                                                                                                                             
        КонецЦикла;                                                                                                                                                      
                                                                                                                                                                         
    КонецПроцедуры