&НаКлиенте                                                                                                                                                        
    Процедура ТоварыКоличествоПриИзменении(Элемент)
        РассчитатьСуммуСтроки();
    КонецПроцедуры
  
    &НаКлиенте
    Процедура ТоварыЦенаПриИзменении(Элемент)
        РассчитатьСуммуСтроки();
    КонецПроцедуры
  
    &НаКлиенте
    Процедура РассчитатьСуммуСтроки()
        ТекСтрока = Элементы.Товары.ТекущиеДанные;
        Если ТекСтрока <> Неопределено Тогда
            ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
        КонецЕсли;
    КонецПроцедуры
