#Область ПрограммныйИнтерфейс

// Получает срез последних цен номенклатуры на указанную дату
// 
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура - Позиция товара или услуги
//   ДатаСреза    - Дата                         - Момент времени
// 
// Возвращаемое значение:
//   Число - Актуальная цена
//
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ДатаСреза) Экспорт
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;
	
	Отбор = Новый Структура("Номенклатура", Номенклатура);
	ЗначенияЦен = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(ДатаСреза, Отбор);
	
	Если ЗначенияЦен.Количество() > 0 Тогда
		Возврат ЗначенияЦен[0].Цена;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Проверяет доступность игрового места
//
// Параметры:
//   ИгровоеМесто - СправочникСсылка.ИгровыеМеста - Проверяемое ПК-место
//   ТекстОшибки  - Строка                       - Выходной параметр с причиной недоступности
//
// Возвращаемое значение:
//   Булево - Истина, если ПК свободен
//
Функция ИгровоеМестоДоступно(ИгровоеМесто, ТекстОшибки = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ИгровоеМесто) Тогда
		ТекстОшибки = "Не указано игровое место";
		Возврат Ложь;
	КонецЕсли;
	
	Если ИгровоеМесто.Статус = Перечисления.СтатусПКМеста.Занято Тогда
		ТекстОшибки = СтрШаблон("Игровое место ""%1"" уже занято другим клиентом!", ИгровоеМесто);
		Возврат Ложь;
	ИначеЕсли ИгровоеМесто.Статус = Перечисления.СтатусПКМеста.Недоступно Тогда
		ТекстОшибки = СтрШаблон("Игровое место ""%1"" на техническом обслуживании!", ИгровоеМесто);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
